{
  "projects": [
    {
      "id": "Bitvis-white-label-app",
      "what": "White-label app",
      "prevImage": "/images/prevImg/white_label_bitvis_pick.png",
      "images": [
        {
          "image": "/images/malar_light.png",
          "imcap": "Three visual directions for the same customer, exploring light, dark, and brand-specific variations while keeping a consistent structure."
        },
        {
          "image": "/images/malar_blue.png",
          "imcap": "Example of how brand colors were tested and adjusted to improve contrast and accessibility across themes."
        },
        {
          "image": "/images/malar_final.png",
          "imcap": "Final concept for Mälarenergi: refined palette and typography tuned for both brand expression and WCAG AA compliance."
        }
      ],

      "heading": "Scaling the White-Label Design at Bitvis",
      "subheading": "From one to thirteen customers in under three years",
      "introduction": "As the first UX designer at Bitvis, I helped shape a white-label app for electricity retailers across Sweden. The goal was to make every customer’s app feel unique and on-brand, while keeping the product consistent, accessible, and easy to maintain.",
      "bullets": [
        "Design systems",
        "Accessibility",
        "White-label product design",
        "Designing for a B2B platform",
        "Scalable UX and frontend collaboration"
      ],
      "sections": [
        {
          "title": "Overview",
          "sectionOne": "As the first UX designer at Bitvis, I helped shape a white-label app for electricity retailers across Sweden. The goal was to make every customer’s app feel unique and on-brand, while keeping the product consistent, accessible, and easy to maintain. Over time, our team grew the platform from one to thirteen clients, refining both the design system and our process along the way."
        },
        {
          "title": "A Modular Foundation with Flexible Branding",
          "sectionOne": "Each retailer came with unique brand requirements, from colors and typography to tone of voice and special features. We introduced a design system based on customizable tokens for color, type, and spacing, paired with Figma variables to quickly generate branded drafts. Above, you can see three design directions for the same customer, each exploring different ways to express their visual identity while staying within the system.",
          "steps": [
            "Customizable design tokens for colors, typography, and spacing",
            "Figma variables for faster brand prototyping",
            "A modular app architecture supporting feature add-ons per retailer"
          ]
        },
        {
          "title": "Prioritizing Accessibility Across Custom Themes",
          "sectionOne": "Early on, some brand colors made accessibility tricky. As smaller retailers often had graphical guidelines not optimized for digital use, we standardized how colors were applied and tested every theme for contrast and color blindness compatibility. The GIF above illustrates how our color tokens allowed instant switching between customers while maintaining WCAG AA compliance.",
          "steps": [
            "Testing each color variant for contrast and color blindness",
            "Refining brand palettes to balance identity and accessibility",
            "Simplifying rules for consistent AA compliance"
          ],
          "sectionImages": [
            {
              "image": "/images/color_tokens.gif",
              "imcap": "Color system in action, switching between two customer themes using shared color tokens."
            }
          ]
        },
        {
          "title": "Scaling Design with Frontend Collaboration",
          "sectionOne": "Initially, we redesigned every view in Figma for each customer. As we grew, we shifted toward a more agile process: developers implemented the core themes directly in the app, and designers reviewed live builds to adjust only what was needed. This made collaboration faster, more dynamic, and more accurate. We designed with the product, not just for it. Below is an example of a shared component, a date picker, displayed in two customer themes.",
          "steps": [
            "Moved from static Figma views to a live, theme-based workflow",
            "Improved iteration speed through early developer collaboration",
            "Ensured each component worked seamlessly across themes"
          ]
        },
        {
          "title": "Scaling the White-Label System and Evolving Our Process",
          "sectionOne": "As the customer base expanded, we developed a structured onboarding process: from the first meeting and introduction to the app, through mockups and design proposals, to the final approval and delivery. This made it easier to balance consistency with flexibility. Some customers wanted small visual touches such as a new color, a feature, or a component, and we learned that keeping to a system doesn’t mean being stuck in it. The result was a design process that felt collaborative, efficient, and scalable.",
          "steps": [
            "From one customer to thirteen in less than three years",
            "Simplified design system for faster onboarding",
            "Introduced a structured onboarding method: intro, mockups, approval, delivery",
            "Balanced system consistency with client flexibility"
          ],
          "sectionImages": [
            {
              "image": "/images/datepicker_two_themes.png",
              "imcap": "Example of a shared component (date picker) displayed in two customer themes, for demonstrating system flexibility and the potential of Figma Variables."
            }
          ]
        }
      ]
    },

    {
      "id": "smaller-display-graphs",
      "what": "Graphs for smaller displays",
      "prevImage": "/images/prevImg/graph_bitvis_pick.png",
      "images": [
        {
          "image": "/images/analysis.png",
          "imcap": "The step graph visualizes electricity usage over time, with an optional comparison layer, such as prices versus purchased electricity. A date picker guides users through selecting the time range to explore in detail."
        }
      ],
      "heading": "Designing Graphs for Smaller Displays",
      "subheading": "Optimizing Data Visualization for an Energy App (2022–2025)",
      "introduction": "Designing a mobile-friendly energy graph required balancing clarity, usability, and accessibility. These were the main design decisions:",
      "bullets": [
        "User experience (UX)",
        "Data visualization",
        "Accessibility",
        "Design–development collaboration"
      ],
      "sections": [
        {
          "title": "Overview",
          "sectionOne": "One of the key screens in the energy app lets users track electricity use and costs. While users want to explore their habits over time, energy companies aim to promote awareness and behavior change. The challenge was to design a clear and engaging graph that works on small screens and serves both goals."
        },
        {
          "title": "Choosing the Right Graph Type",
          "steps": [
            "We chose a step graph to balance clarity and interactive touch experience on mobile."
          ],
          
          "subsections": [
            {
              "sectionOne": "We compared several visualization types before selecting a step graph — a balance between the clarity of bars and the smooth interaction of lines.",
              "subSteps": [
                "Line graphs feel interactive but imply continuous data, which doesn’t fit hourly readings.",
                "Bar graphs show discrete values clearly but feel static and are harder to use on touchscreens.",
                "Step graphs combine both strengths, giving clear structure and an intuitive touch experience."
              ]
            }
          ]
        },
        {
          "title": "Making Data Readable on Mobile",
          "sectionOne": "On desktop dashboards, it’s common to hover over a graph to see the value for a specific point. On mobile, this interaction doesn’t work well — tooltips often get hidden behind the user’s finger, and text can be too small to read. To solve this, we implemented large, fixed-position values that stay visible without interaction, making key information easy to read while scrolling or tapping."
        },
        {
          "title": "Visual Design and Accessibility",
          "sectionOne": "We refined the graph’s visual appearance to clearly separate datasets and support all users, including those with color vision deficiencies. Subtle styling helps users understand the data without distraction, while accessibility markers provide extra clarity.",
          "steps": [
            "Gradient on the main line adds depth without distraction.",
            "Comparison lines outlined for clear separation.",
            "Color choices tested for contrast and accessibility.",
            "Shapes (circles and squares) support color-blind interpretation."
          ]
        },
        {
          "title": "Designing the Date Picker",
          "sectionOne": "Over the years, we iterated through multiple date picker designs. The final solution is a mobile sheet that opens when the user taps the date in the analysis view. Inside the sheet, users can select the interval they want to visualize: hourly for a day, day-by-day for a month, or monthly for a year. Once the sheet is closed, the graph updates to show one step per selected period. Users can also step forward or backward in the analysis view without reopening the sheet, making exploration smoother. To inform the design, we researched patterns across energy apps, travel booking apps, and other common mobile interfaces, balancing familiarity with the extra functionality required for period selection.",
          "steps": [
            "Mobile sheet opens when tapping the date.",
            "Users select interval: hourly, daily, or monthly.",
            "Graph updates automatically; can step forward/back without reopening.",
            "Design inspired by familiar patterns, with extra functionality for period selection."
          ]
        },
        {
          "title": "Comparing Data Types and Technical Constraints",
          "sectionOne": "Users needed to compare electricity consumption and cost per kWh to understand usage patterns and manage costs. For example, they wanted to see whether electricity was used during cheaper times of day, or to investigate why a bill was higher than expected. Beyond individual bills, users could explore historical consumption data to learn general household patterns and make informed decisions for future behavior. Initially, we used Victory Chart to quickly prototype the graphs, but as requirements grew, we transitioned to Skia for more flexibility and refined interactions.",
          "steps": [
            "Enabled dual Y-axes and toggle for consumption vs. cost for clarity and usability.",
            "Transitioned from Victory Chart to Skia for more control and performance.",
            "Close collaboration between design and development ensured feasible and usable solutions."
          ],
           "sectionImages": [
            {
              "image": "/images/analys_old.gif",
              "imcap": "First version (2022) of the Ananlys-view in the app, using Victory Chart libary and an open source date-picker"
            },
            {
              "image": "/images/analys_new.gif",
              "imcap": "2025 version of the Ananlys-view in the app, now using Skia Graphics Engine and our own date-picker design. "
            }
          ],
          "subsections": [
            {
              "title": "Initial Approach with Victory Chart",
              "sectionOne": "Victory Chart allowed us to quickly prototype graphs and iterate on visual ideas early in development.",
              "subSteps": [
                "Fast to implement initial visualizations.",
                "Good for testing layouts and basic interactions.",
                "Helped get a functional graph in front of users early."
              ]
            },
            {
              "title": "Transition to Skia for Flexibility",
              "sectionOne": "As the app matured, Victory Chart’s constraints became limiting. Skia offered more freedom but required careful coordination with developers due to rendering rules and limited documentation.",
              "subSteps": [
                "Iterative adjustments when visual ideas didn’t align with Skia’s behavior.",
                "Regular design-developer discussions to find feasible solutions.",
                "Enabled refined interactions and multi-dataset comparisons without clutter."
              ]
            }
          ]
        },
        {
          "title": "Outcome",
          "sectionOne": "The result was a responsive and accessible graph module that balanced usability and performance across devices. The iterative collaboration between design and development improved alignment across teams and helped establish shared standards for future data visualization components."
        }
      ]
    },

    {
      "id": "Dashboard-concept",
      "what": "Concept of a Dashboard",
      "prevImage": "/images/prevImg/dashboard_pick.png",

      "images": [
        {
          "image": "/images/powerFlow_components.png",
          "imcap": "UI components including buttons, graph, and list elements. Created to demonstrate how Power Flow could evolve into a more intuitive and engaging dashboard experience."
        }
      ],
      "heading": "Reimagining an Energy Dashboards",
      "subheading": "Designing clarity, emotion, and usability into technical systems (20022)",
      "introduction": "Together with a colleague, I created a visionary concept for Power Flow — a dashboard system used by energy retailers. The goal was to explore how the interface could evolve into something more intuitive, emotionally engaging, and user-friendly. The concept was used in sales and internal discussions to spark ideas and shift focus toward UX-driven development.",
      "bullets": [
        "Dashboard UX design",
        "Visual storytelling",
        "Figma prototyping",
        "Customer research",
        "Designing for emotional tone"
      ],
      "sections": [
        {
          "title": "Overview",
          "sectionOne": "Flow is a business-to-business (B2B) customer interface originally designed for fiber network providers. It’s part of an open OSS/BSS system that automates everything from order handling to operational insights—helping companies scale efficiently and cost-effectively. In this project, our challenge was to adapt Flow for a new market: energy retailers. The existing version, known as Power Flow, was already in use, but its user experience was limited and heavily shaped by technical constraints. We wanted to explore what a future version could look like—one that felt intuitive, engaging, and tailored to the needs of energy companies. Our concept was not a finished product, but a vision piece: something to spark conversations, support sales, and shift focus from technical limitations to user-centered possibilities. "
        },
        {
          "title": "Designing with Emotion and Clarity",
          "sectionOne": "We spoke with current customers to understand what they wanted from a dashboard. Based on their feedback, we designed a layout that combined real-time graphs, map views, and customer lists. To make the interface feel less intimidating, we used pastel tones and soft lilac: colors that stood out in presentations and created a homely, non-technical atmosphere.",
          "steps": [
            "Graph panel showing electricity usage, EV charging, and solar production",
            "Map panel highlighting areas of high consumption",
            "List view showing customer status and activity",
            "Interactive buttons and filters designed for clarity and ease of use"
          ]
        },
        {
          "title": "Sales Integration and Strategic Impact",
          "sectionOne": "The concept was used in pitch decks and demos to show what Power Flow could become. It helped shift conversations from technical limitations to user-centered possibilities, and positioned our team as UX-driven innovators."
        },
        {
          "title": "What I Learned",
          "sectionOne": "Designing visionary concepts is not just about aesthetics, it's about strategic communication. I learned how to use design to spark ideas, support sales, and advocate for better user experiences in technical domains. I also deepened my understanding of how visual tone can influence perception and engagement."
        }
      ]
    },
    {
      "id": "portfolio-design",
      "what": "Simple Porfolio",
      "prevImage": "/images/prevImg/portfolio_pick.png",

      "images": [
        {
          "image": "/images/logga.svg",
          "imcap": "SVG animation doubling as a personal line art logo. One continuous line writes my name, with the surrounding box symbolizing the 'O' in my surname. "
        }
      ],
      "heading": "Designing and implementing this portfolio",
      "subheading": "A Project for learning more about react (2025)",
      "introduction": "This webpage is a space where you can get a quick and honest impression of who I am and the work I do. My focus has been on creating a simple and intuitive design without relying on unnecessary animations or flashy distractions. Instead, I’ve built this portfolio to reflect my passion for simplicity, clarity, and functionality.",
      "bullets": [
        "User experience (UX)",
        "SVG-animations",
        "Front-end development with React"
      ],

      "sections": [
        {
          "title": "Overview",
          "sectionOne": "This webpage is a space where you can get a quick and honest impression of who I am and the work I do. I’ve focused on keeping the design simple and intuitive, avoiding excessive CSS animations —but I couldn't resist adding a playful SVG animation of a logo."
        },
        {
          "title": "Design Process",
          "sectionOne": "I have designed this page naturally, drawing inspiration from others and selecting elements that align with my three guiding principles: simplicity, clarity, and efficiency.",

          "steps": [
            "Efficiency: While I would love for my readers to learn everything about me, I respect their valuable time and aim to deliver key insights quickly. ",
            "Clarity: I want visitors to get a quick glimpse of my work fast enough to capture interest but slow enough to intrigue leaving them wanting to know more.",
            "Simplicity: To be kind to the developer, which happens to be me"
          ]
        },
        {
          "title": "Colors and Theme Adaptation",
          "sectionOne": "The color palette of this portfolio adapts automatically to the visitor’s system theme, creating a smoother and more comfortable experience whether in light or dark mode. This avoids the jarring effect of suddenly landing on a bright page when browsing in dark mode, or a dark page when in light mode. In light mode, the design features a warm beige background and deep green text, chosen for their softness and readability. These same colors are also used in my CV to maintain a consistent and calming visual identity across materials. The dark mode version offers high contrast while remaining easy on the eyes, staying true to my design principles of clarity, simplicity, and efficiency."
        },
        {
          "title": "Creating the webb page, using React",
          "sectionOne": "Every part of this portfolio is built using React and Next.js. Building this portfolio has been a learning journey, where I’ve honed my skills in React while keeping the design and functionality aligned with my principles of simplicity, clarity, and efficiency. "
        }
      ]
    },

    {
      "id": "openSpace",
      "what": "OpenSpace",
      "prevImage": "/images/prevImg/openspace_pick.png",

      "images": [
        {
          "image": "/images/introduction_blue.png",
          "imcap": "The starting page of the interface is were the user can pick a story. When the program starts the instruction button in the left corner in blinking to get the user’s attention."
        }
      ],

      "heading": "Interactive Visualization of Climate Change",
      "subheading": "Master’s Thesis, Linköping University at New York University (2022) ",
      "introduction": "Designing an interactive storytelling experience about Antarctic ice melt",
      "bullets": [
        "UX and interaction design for scientific visualization",
        "Interface development in React",
        "Data transformation and geospatial analysis",
        "Interactive storytelling and narrative UX",
        "User testing and iteration"
      ],
      "link": {
        "link": "/files/masterThesis.pdf",
        "linkcap": "Master thesis report"
      },
      "sections": [
        {
          "title": "Overview",
          "sectionOne": "This project was part of my master’s thesis in media technology at Linköping University, in collaboration with the OpenSpace project, NASA, and the American Museum of Natural History. My goal was to design an interactive visualization of climate change data, focused on Antarctic glaciers, for a general audience.",
          "sectionTwo": "The challenge was to take complex satellite datasets and make them understandable, engaging, and explorable through visual storytelling in OpenSpace, a scientific visualization platform used in museums and planetariums."
        },
        {
          "title": "My Role",
          "sectionOne": "I was responsible for the full UX and data visualization process.",
          "subsections": [
            {
              "subSteps": [
                "Researched and storyboarded the climate story with input from experts",
                "Designed and implemented the user interface in React",
                "Developed two navigation modes: a structured narrative and an open-world exploration",
                "Converted scientific datasets from raw formats to visual layers (NetCDF to GeoTIFF to VRT)",
                "Conducted user testing and iterated based on feedback"
              ]
            }
          ]
        },
        {
          "title": "Problem",
          "sectionOne": "Climate change data is typically created for researchers. Visualizations are dense, interfaces are complex, and non-expert users often struggle to understand the impact of these changes. ",
          "sectionTwo": "The question I focused on was: How might we design a visual and interactive experience that allows the general public to explore glacier melting in Antarctica without prior scientific knowledge?"
        },
        {
          "title": "Design Process",
          "sectionOne": "The design process included four key phases from research to implementation and testing.",

          "sectionImages": [
            {
              "image": "/images/storyline.png",
              "imcap": "Storyline draft over how the ice is melting and the consequences (1) Viewing the Earth from space with orbiting satellites collecting data, (2) Overview of surface currents and their connections from north to south, (3) Detailed view of surface currents over time, (4) Ice melt in Antarctica visualized over time, (5) Glaciers and potential collapses, (6) Global consequences of ice loss."
            }
          ],
          "subsections": [
            {
              "title": "1. Understanding the data and story",
              "sectionOne": "I began by taking an online course on climate science and meeting regularly with a climate physicist at the American Museum of Natural History. Together we identified the Thwaites Glacier (also known as the Doomsday Glacier) as the focal point of the story. I selected satellite datasets such as GRACE (gravity-based ice mass loss) and ECCO (ocean currents) and converted them using Python, GDAL and QGIS into formats that could be displayed on a virtual 3D globe in OpenSpace."
            },
            {
              "title": "2. Storyboarding and UX design",
              "sectionOne": "I explored different forms of interactive storytelling and decided to implement two modes:",
              "subSteps": [
                "A decision-based narrative, where users could follow a guided story about glacier melting and sea-level rise on different continents, see image above for the steps in one of the storylines",
                "An open-world mode, where users could freely explore datasets, switch layers, and zoom in on different parts of Earth"
              ],
              "sectionTwo": "Using Figma, I sketched layouts for both story modes, tested UI component placement, and iterated on navigation flows. I focused on keeping Earth in view at all times, with side panels for text, legends, and time controls."
            },
            {
              "title": "3. Interface implementation in React",
              "sectionOne": "I developed the interface using React, integrating it with OpenSpace’s OpenGL backend through a custom API. The interface included:",
              "subSteps": [
                "A timeline controller to step through time-based datasets",
                "Next and previous buttons for the narrative mode",
                "A story selector and category menu for the open-world mode",
                "Dynamic color legends and info panels that updated per dataset"
              ],
              "sectionTwo": "Each component was connected to a JSON-based story API that made it easy to update or extend content."
            },
            {
              "title": "4. User testing and iteration",
              "sectionOne": "I conducted think-aloud user testing with seven participants, including climate scientists, OpenSpace developers, and lay users. The sessions revealed several key usability issues:",
              "subSteps": [
                "Users misunderstood color mappings (e.g., thought red-blue meant temperature, not ice mass)",
                "Spinning Earth made it hard to focus on reading content",
                "Text lengths needed balancing between too much detail and too little guidance"
              ],
              "sectionTwo": "I adjusted the interface accordingly: slowed down animations, clarified legends, refined color schemes, and reorganized information for better accessibility."
            }
          ]
        },
        {
          "title": "Outcome",
          "sectionOne": "The final interface was successfully integrated into OpenSpace and tested with users of varying backgrounds. It allowed non-experts to explore scientific climate data and learn through interaction.",

          "sectionImages": [
            {
              "image": "/images/grace.png",
              "imcap": "Visualization of Antarctic ice melt over time using GRACE data. Blue and orange indicate ice loss and gain, chosen for color-blind accessibility. The legend helps interpret the intensity of changes."
            }
          ],
          "steps": [
            "Follow a narrative about glacier melt and sea-level rise",
            "Explore real climate datasets with minimal friction",
            "Gain a spatial understanding of global currents and local effects"
          ],
          "sectionTwo": "The storytelling format helped users emotionally connect to abstract scientific data, while the visual tools supported intuitive learning"
        },
        {
          "title": "What I Learned",
          "sectionOne": "Designing for scientific communication requires careful balance between accuracy and accessibility. I learned how to translate abstract climate data into an intuitive experience, and how to use storytelling as a tool for engagement and education. I also deepened my skills in cross-functional collaboration, working closely with researchers, developers, and museum professionals."
        }
      ]
    },
    {
      "id": "education",
      "what": "Education",
      "prevImage": "/images/prevImg/mt_pick.png",

      "images": [
        {
          "image": "/images/logo_mt.png",
          "imcap": "Master of Science in Media Technology at Linköping University Logo",
          "theme": "dark"
        },
        {
          "image": "/images/logo_mt_black.png",
          "imcap": "Master of Science in Media Technology at Linköping University Logo",
          "theme": "light"
        }
      ],

      "heading": "Education:  Master of Science in Media Technology",
      "subheading": "A broad and interdisciplinary foundation in digital systems, design, and software development, at Linköping University. (1017-1022) ",
      "introduction": "A broad and interdisciplinary foundation in digital systems, design, and software development. ",
      "bullets": [
        "UX and interaction design",
        "Data visualization",
        "Frontend development (HTML/CSS/JS)",
        "Programming in C++",
        "AI and machine learning fundamentals",
        "Graphic design and visual communication"
      ],
      "sections": [
        {
          "title": "Overview",
          "sectionOne": "My Master’s in Media Technology gave me a broad and interdisciplinary foundation in digital systems, design, and software development. The program combined creative and technical perspectives, allowing me to explore everything from graphic design and frontend development to AI, C++ programming, and data visualization."
        },
        {
          "title": "Finding My Focus: Where Design Meets Data and People",
          "sectionOne": "While I enjoyed the technical breadth of the program, I found myself especially drawn to courses in UX, interaction design, and visualization. I became fascinated by how design can bridge the gap between complex data and human understanding—how interfaces can guide behavior, support decision-making, and create emotional resonance.",
          "sectionTwo": "One project that stood out involved designing a dashboard for environmental data. It was the first time I saw how layout, hierarchy, and visual tone could turn raw statistics into something meaningful and actionable. That experience sparked my long-term interest in designing tools that simplify complexity and make technology feel more human."
        },

        {
          "title": "What I Learned",
          "sectionOne": "My education taught me to see design as a strategic tool—one that connects people, data, and technology. It also gave me the technical confidence to work across disciplines, and the curiosity to keep learning. Today, I bring that mindset into every project: combining structure and empathy, logic and creativity"
        }
      ]
    }
  ]
}
