
{
  "projects": [


     {
      "id": 1,
      "what": "White-label app",
      "images": [
        {
          "image": "/images/malar_light.png"
        },
        {
          "image": "/images/malar_blue.png"
        },
        {
          "image": "/images/malar_final.png"
        }
       
      ],
      "heading": "Designing for Everyone: White-label UX with a Personal Touch",
      "subheading": "Balancing customization, consistency, and accessibility",
      "introduction": "When designing a mobile-friendly energy consumption graph, several key decisions shaped the final outcome:",
     
      "sections": [
        {
          "title" : "Overview",
          "content": "Bitvis offers a white-label app for electricity retailers in Sweden, designed to make each end customer feel seen and prioritized. This required an interface that felt personal and on-brand, without fragmenting the core product or adding complexity. Each retailer had its own view of customer needs, which gave us valuable, ongoing user feedback. The challenge: How do you create a tailored experience for each client while maintaining consistency, accessibility, and ease of maintenance?"
 
          
        },
        
        {
          "title" : "A Modular Foundation with Flexible Branding for a “Homely” Experience",
          "content": "Each retailer had unique brand requirements — from color schemes and typography to tone of voice, as well as their own feature requests. To support this, we introduced a design system built around:",
          "steps": [
          "Customizable design tokens for colors, typography, and spacing",
          "Figma variables to quickly create and present tailored design drafts — as seen to the left, where we explored three brand themes for the same customer.",
          "A modular app architecture that allows smaller feature add-ons to highlight each retailer’s unique services"
          ]
        },
        {
          "title" : "Prioritizing Accessibility Across Custom Themes",
          "content": "Different color schemes and branding requirements introduced a risk: inconsistent contrast ratios or color combinations that could fail accessibility standards — especially as smaller electricity retailers often had graphical brand books with colors that weren’t ideal for user interfaces or WCAG AA compliance. To maintain accessibility:",
          "steps": [
            "Every theme variant was tested for color blindness compatibility and AA compliance",
            "When needed, we created new color schemes that still preserved the 'homely' brand feel"
            ]
            
        },
        {
          "title" : "Scaling Design with Frontend Collaboration",
          "content": "Design and development worked closely to ensure the white-label system was scalable and maintainable. Every new component was tested across multiple customer themes to ensure it worked seamlessly with minimal need for special treatment per electricity retailer."
       
        },
        {
          "title": "Skills Highlighted",
          "steps": [
            "Design systems",
            "Accessibility ",
            "White-label product design",
            "Designing for a B2B system",
            "UX consistency across clients"
          ]
        }
      ]
      
    },









    {
      "id": 2,
      "what": "Graphs for smal screens",
      "images": [
        {
          "image": "/images/analys.png"
        },
        {
          "image": "/images/datepicker.png"
        }
       
      ],
      "heading": "Designing graphs for smal screens",
      "subheading": "Optimizing Data Visualization for an Electrical Consumption App",
      "introduction": "When designing a mobile-friendly energy consumption graph, several key decisions shaped the final outcome:",
     
      "sections": [
        {
          "title" : "Overview",
          "content": "One of the key pages in an electrical consumption app is where users can monitor their energy usage and costs. While users want insights into their consumption habits across different time periods—ranging from hourly to yearly—electricity companies also aim to help them recognize patterns and adjust their behaviors. This presents a design challenge: how can we create a clear, accessible, and engaging graph that serves both perspectives while remaining easy to use on small screens? "
          
        },
        {
          "title" : "1. Choosing the Right Graph Type",
          "content": "After exploring several options, we settled on a step graph as the most suitable choice. It blends the advantages of line and bar graphs, providing clarity and a more interactive experience without misrepresenting the data.",
          
          "steps": [
            "A line graph suggests continuous data, which doesn’t accurately represent hourly electricity readings where each hour should be treated as a discrete point on the x-axis. However, one advantage of line graphs is that they feel more interactive, inviting users to naturally drag along the curve with their fingers, especially on mobile.",
            "A bar graph visualizes discrete data more correctly, clearly separating each hourly value. On the downside, bars tend to feel more static and can make touch interactions less smooth, especially on smaller screens, where hovering or selecting with precision becomes harder.",
            "By combining the advantages of both, a step graph became the optimal choice. It offers the structural clarity of bars while maintaining the inviting, interactive feel of a line graph. This makes it easy for users to recognize consumption patterns and navigate the data seamlessly on mobile devices."
          ]
        },
        {
          "title" : "2. Improving Data Readability on Mobile",
          "content": "Traditional tooltips are commonly used in graphs to display data when hovering, but this pattern does not translate well to mobile apps. On touchscreens, tooltips often end up hidden behind the user’s finger, making them difficult to read. To avoid covering too much of the graph, tooltip text also tends to be small, which further reduces legibility. To solve this, we implemented large, fixed-position data values that remain visible without requiring interaction, ensuring that key information is easy to read — even when navigating with thumbs.",   "steps": [   
              ]
       
        },
        {
          "title" : "3.  Comparing Different Data Types Without Overload",
          "content": "Users needed to compare both electricity consumption (kWh) and cost per kWh within the same graph. However, multi-variable graphs risk becoming overwhelming. To balance clarity and functionality:",
          "steps": [   
           "We introduced dual Y-axes with matching visual styles.",
           "Users can choose to toggle comparison data, keeping the default view simple for less advanced users while still enabling deeper insights for those who want them. "
            ]
       
        },
        {
          "title" : "4. Enhancing Readability Through Visual Design",
          "content": "To clearly separate datasets:",
          "steps": [   
           "The main consumption line features a subtle gradient to give it depth without distraction.",
           "Comparison lines use a white border to remain distinct even when colors overlap, without introducing additional gradients or noise.",
           "Color choices were made with accessibility in mind, ensuring that all users — including those with color vision deficiencies — can clearly interpret the data.", 
           "Additionally, to ensure accessibility for users with color vision deficiencies, we introduced small graphical markers (circles and squares) on both the graph lines and the corresponding data labels."
                 ]
       
        },
        {
          "title" : "5. The date picker for the graph",
          "content": "We also designed a date picker tailored for mobile use, enabling users to easily switch between day, week, month, and year views. It adapts seamlessly to small screens and allows users to explore historical data without friction. "
        },
        {
          "title": "Skills Highlighted",
          "steps": [
            "User experience (UX)",
            "Data Visualization",
            "Accesability"
          ]
        }
      ]
      
    },
    {
      "id": 3,
      "what": "Simple Porfolio",
      "images": [
        {
          "image": "/images/logga.svg"
        }
       
      ],
      "heading": "Implementaion and Designing a simple portfolio",
      "subheading": "A Project for learning more about react (2024)",
      "introduction": "This webpage is a space where you can get a quick and honest impression of who I am and the work I do. My focus has been on creating a simple and intuitive design without relying on unnecessary animations or flashy distractions. Instead, I’ve built this portfolio to reflect my passion for simplicity, clarity, and functionality.",

     
      "sections": [
        {
          "title" : "Overview",
          "content": "This webpage is a space where you can get a quick and honest impression of who I am and the work I do. I’ve focused on keeping the design simple and intuitive, avoiding excessive CSS animations —but I couldn't resist adding a playful SVG animation of a logo."
        },
        {
          "title" : "Design Process",
          "content": "I have designed this page naturally, drawing inspiration from others and selecting elements that align with my three guiding principles: simplicity, clarity, and efficiency.",
         
          "steps": [            
            "Efficiency: While I would love for my readers to learn everything about me, I respect their valuable time and aim to deliver key insights quickly. ",
            "Clarity: I want visitors to get a quick glimpse of my work fast enough to capture interest but slow enough to intrigue leaving them wanting to know more.",
            "Simplicity: To be kind to the developer, which happens to be me"
          ]
       
        },
        {
          "title" : "Creating the webb page, using React",
          "content": "Every part of this portfolio is built using React and Next.js. Building this portfolio has been a learning journey, where I’ve honed my skills in React while keeping the design and functionality aligned with my principles of simplicity, clarity, and efficiency. "
        },
        {
          "title": "Skills Highlighted",
          "steps": [
            "User experience (UX)",
            "SVG-animations",
            "Front-end development with React"
          ]
        }
      ]
      
    },

    {
      "id": 4,
      "images":[
        {
          "image": "/images/introduction_blue.png"
        },
        {
          "image": "/images/grace.png"
        }
       
      ],
      "what": "OpenSpace",
      "heading": "Interactive Visualization of Climate Change in the OpenSpace Project",
      "subheading": "Master’s Thesis, Linköping University at New York University (2022) ",
      "sections": [
        {
          "title": "Overview",
          "content": "For my master’s thesis, I designed and developed an interactive graphical user interface (GUI) to visualize climate change on Earth’s surface, with a specific focus on the melting glaciers of Antarctica. This project was part of the international OpenSpace initiative, a collaboration involving universities, research institutions, and NASA."
        },
        {
          "title": "Design Process",
          "content": "The project followed an iterative design methodology to create a user-friendly interface that communicates complex scientific data to the general public. I conducted in-depth research to better understand the challenges and user needs related to climate visualization. This process involved close collaboration with climate experts and stakeholders to refine the project’s focus and ensure relevance. Additionally, I developed wireframes and prototypes in Figma, which were iteratively tested to explore and validate interaction concepts.",
          
          "steps": [
            "Story-driven exploration: Users could follow an engaging narrative to learn about climate change, transitioning between global trends and localized impacts.",
            "Interactive controls: Time sliders, visual overlays, and color-coded indicators allowed users to explore datasets intuitively.",
            "Open-world mode: Users could freely explore climate data globally, discovering patterns and correlations on their own terms."
          ]
        },
        {
          "title": "Development",
          "content": "The technical implementation involved programming the GUI in React and integrating it with OpenSpace’s C++ backend using a custom-built API.",
          "steps": [
            "Transformed multidimensional satellite datasets into OpenSpace-compatible formats using Python.",
            "Handled datasets such as global ocean currents, ice melt trends, and gravity field measurements.",
            "Enabled smooth transitions between local and global visualizations, ensuring accessibility for non-expert users."
          ]
        },
        {
          "title": "Outcome",
          "content": "The final product was tested with seven users from varied backgrounds, including climate experts and non-specialists, yielding valuable insights for refinement. Feedback confirmed that the application succeeded in making complex climate data more understandable and engaging."
        },
        {
          "title": "Skills Highlighted",
          "steps": [
            "User experience (UX) design",
            "Interactive storytelling",
            "Front-end development with React",
            "Data processing and transformation with Python",
            "Integration with scientific visualization tools"
          ]
        }
      ]
    
      
    }
  ]
}

